wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Source/startup_TC8263.c
extern const VECTOR_TABLE_Type __VECTOR_TABLE[];
       const VECTOR_TABLE_Type __VECTOR_TABLE[] __VECTOR_TABLE_ATTRIBUTE =
{
    (VECTOR_TABLE_Type)(&__INITIAL_SP),       /*      Initial Stack Pointer                             */
    Reset_Handler,                            /*      Reset Handler                                     */
    NMI_Handler,                              /*  -14 NMI Handler                                       */
    HardFault_Handler,                        /*  -13 Hard Fault Handler                                */
    MemManage_Handler,                        /*  -12 MPU Fault Handler                                 */
    BusFault_Handler,                         /*  -11 Bus Fault Handler                                 */
    UsageFault_Handler,                       /*  -10 Usage Fault Handler                               */
    SecureFault_Handler,                      /*   -9 Secure Fault Handler                              */
    0,                                        /*      Reserved                                          */
    0,                                        /*      Reserved                                          */
    0,                                        /*      Reserved                                          */
    SVC_Handler,                              /*   -5 SVC Handler                                       */
    DebugMon_Handler,                         /*   -4 Debug Monitor Handler                             */
    0,                                        /*      Reserved                                          */
    PendSV_Handler,                           /*   -2 PendSV Handler Handler                            */
    SysTick_Handler,                          /*   -1 SysTick Handler                                   */

    /* Interrupts */
    BODOUT_IRQHandler,                        /*!<   0 Brown-Out Low Voltage Detected Interrupt Handler */
    IRC_IRQHandler,                           /*!<   1 IRC TRIM Interrupt Handler                       */
    PMC_IRQHandler,                           /*!<   2 Power Mode Controller Interrupt Handler          */
    SRAMPERR_IRQHandler,                      /*!<   3 SRAM Parity Check Error Interrupt Handler        */
    CKFAIL_IRQHandler,                        /*!<   4 Clock Fail Detected Interrupt Handler            */
    ISP_IRQHandler,                           /*!<   5 FMC ISP Interrupt Handler                        */
    RTC_IRQHandler,                           /*!<   6 Real Time Clock Interrupt Handler                */
    RTCTAMPER_IRQHandler,                     /*!<   7 Backup Register Tamper Interrupt Handler         */
    WDT0_IRQHandler,                          /*!<   8 Watchdog Timer 0 Interrupt Handler               */
    WWDT0_IRQHandler,                         /*!<   9 Window Watchdog Timer 0 Interrupt Handler        */

    TAMPER_IRQHandler,                        /*!<  10 Tamper Interrupt Handler                         */
    WDT1_IRQHandler,                          /*!<  11 Watchdog Timer 1 Interrupt Handler               */
    WWDT1_IRQHandler,                         /*!<  12 Window Watchdog Timer 1 Interrupt Handler        */
    NPU_IRQHandler,                           /*!<  13 Neural Network Processor Interrupt Handler       */
    EINT0_IRQHandler,                         /*!<  14 External Input 0 Interrupt Handler               */
    EINT1_IRQHandler,                         /*!<  15 External Input 1 Interrupt Handler               */
    EINT2_IRQHandler,                         /*!<  16 External Input 2 Interrupt Handler               */
    EINT3_IRQHandler,                         /*!<  17 External Input 3 Interrupt Handler               */
    EINT4_IRQHandler,                         /*!<  18 External Input 4 Interrupt Handler               */
    EINT5_IRQHandler,                         /*!<  19 External Input 5 Interrupt Handler               */

    GPA_IRQHandler,                           /*!<  20 GPIO Port A Interrupt Handler                    */
    GPB_IRQHandler,                           /*!<  21 GPIO Port B Interrupt Handler                    */
    GPC_IRQHandler,                           /*!<  22 GPIO Port C Interrupt Handler                    */
    GPD_IRQHandler,                           /*!<  23 GPIO Port D Interrupt Handler                    */
    GPE_IRQHandler,                           /*!<  24 GPIO Port E Interrupt Handler                    */
    GPF_IRQHandler,                           /*!<  25 GPIO Port F Interrupt Handler                    */
    GPG_IRQHandler,                           /*!<  26 GPIO Port G Interrupt Handler                    */
    GPH_IRQHandler,                           /*!<  27 GPIO Port H Interrupt Handler                    */
    GPI_IRQHandler,                           /*!<  28 GPIO Port I Interrupt Handler                    */
    GPJ_IRQHandler,                           /*!<  29 GPIO Port J Interrupt Handler                    */

    BRAKE0_IRQHandler,                        /*!<  30 EPWM0 Brake Interrupt Handler                    */
    EPWM0P0_IRQHandler,                       /*!<  31 EPWM0 Pair 0 Interrupt Handler                   */
    EPWM0P1_IRQHandler,                       /*!<  32 EPWM0 Pair 1 Interrupt Handler                   */
    EPWM0P2_IRQHandler,                       /*!<  33 EPWM0 Pair 2 Interrupt Handler                   */
    BRAKE1_IRQHandler,                        /*!<  34 EPWM1 Brake Interrupt Handler                    */
    EPWM1P0_IRQHandler,                       /*!<  35 EPWM1 Pair 0 Interrupt Handler                   */
    EPWM1P1_IRQHandler,                       /*!<  36 EPWM1 Pair 1 Interrupt Handler                   */
    EPWM1P2_IRQHandler,                       /*!<  37 EPWM1 Pair 2 Interrupt Handler                   */
    BPWM0_IRQHandler,                         /*!<  38 BPWM0 Interrupt Handler                          */
    BPWM1_IRQHandler,                         /*!<  39 BPWM1 Interrupt Handler                          */

    0,                                        /*!<     Reserved                                         */
    PDMA0_IRQHandler,                         /*!<  41 PDMA0 Interrupt Handler                          */
    PDMA1_IRQHandler,                         /*!<  42 PDMA1 Interrupt Handler                          */
    LPPDMA_IRQHandler,                        /*!<  43 Low Power PDMA Interrupt Handler                 */
    SCU_IRQHandler,                           /*!<  44 SCU Interrupt Handler                            */
    0,                                        /*!<     Reserved                                         */
    KS_IRQHandler,                            /*!<  46 Key Store Interrupt Handler                      */
    TIMER0_IRQHandler,                        /*!<  47 Timer0 Interrupt Handler                         */
    TIMER1_IRQHandler,                        /*!<  48 Timer1 Interrupt Handler                         */
    TIMER2_IRQHandler,                        /*!<  49 Timer2 Interrupt Handler                         */

    TIMER3_IRQHandler,                        /*!<  50 Timer3 Interrupt Handler                         */
    LPTMR0_IRQHandler,                        /*!<  51 Low Power Timer 0 Interrupt Handler              */
    LPTMR1_IRQHandler,                        /*!<  52 Low Power Timer 1 Interrupt Handler              */
    0,                                        /*!<     Reserved                                         */
    TTMR0_IRQHandler,                         /*!<  54 Tick Timer 0 Interrupt Handler                   */
    TTMR1_IRQHandler,                         /*!<  55 Tick Timer 1 Interrupt Handler                   */
    USBH0_IRQHandler,                         /*!<  56 USB Host 0 Interrupt Handler                     */
    USBH1_IRQHandler,                         /*!<  57 USB Host 1 Interrupt Handler                     */
    USBD_IRQHandler,                          /*!<  58 USB Device Interrupt Handler                     */
    USBOTG_IRQHandler,                        /*!<  59 USB OTG Interrupt Handler                        */

    HSUSBH_IRQHandler,                        /*!<  60 High Speed USB Host Interrupt Handler            */
    HSUSBD_IRQHandler,                        /*!<  61 High Speed USB Device Interrupt Handler          */
    HSOTG_IRQHandler,                         /*!<  62 High Speed OTG Interrupt Handler                 */
    EMAC0_IRQHandler,                         /*!<  63 EMAC0 Interrupt Handler                          */
    QSPI0_IRQHandler,                         /*!<  64 QSPI0 Interrupt Handler                          */
    QSPI1_IRQHandler,                         /*!<  65 QSPI1 Interrupt Handler                          */
    SPI0_IRQHandler,                          /*!<  66 SPI0 Interrupt Handler                           */
    SPI1_IRQHandler,                          /*!<  67 SPI1 Interrupt Handler                           */
    SPI2_IRQHandler,                          /*!<  68 SPI2 Interrupt Handler                           */
    SPI3_IRQHandler,                          /*!<  69 SPI3 Interrupt Handler                           */

    0,                                        /*!<     Reserved                                         */
    LPSPI0_IRQHandler,                        /*!<  71 Low Power SPI 0 Interrupt Handler                */
    0,                                        /*!<     Reserved                                         */
    SPIM0_IRQHandler,                         /*!<  73 SPIM0 Interrupt Handler                          */
    SPIM1_IRQHandler,                         /*!<  74 SPIM1 Interrupt Handler                          */
    UART0_IRQHandler,                         /*!<  75 UART0 Interrupt Handler                          */
    UART1_IRQHandler,                         /*!<  76 UART1 Interrupt Handler                          */
    UART2_IRQHandler,                         /*!<  77 UART2 Interrupt Handler                          */
    UART3_IRQHandler,                         /*!<  78 UART3 Interrupt Handler                          */
    UART4_IRQHandler,                         /*!<  79 UART4 Interrupt Handler                          */

