wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Source/startup_TC8263.c
    UTCPD_IRQHandler,                         /*!< 150 UTCPD Interrupt Handler                          */
    ETI_IRQHandler,                           /*!< 151 ETI Interrupt Handler                            */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */

    GDMACH0_IRQHandler,                       /*!< 160 GDMA Channel 0 Interrupt Handler                 */
    GDMACH1_IRQHandler,                       /*!< 161 GDMA Channel 1 Interrupt Handler                 */
};

#if defined ( __GNUC__ )
    #pragma GCC diagnostic pop
#endif

/*----------------------------------------------------------------------------
  Reset Handler called on controller reset
 *----------------------------------------------------------------------------*/
__NO_RETURN void Reset_Handler(void)
{
    if ((__PC() & NS_OFFSET) == 0)
    {
        do
        {
            SYS->REGLCTL = 0x59UL;
            SYS->REGLCTL = 0x16UL;
            SYS->REGLCTL = 0x88UL;
        }
        while(SYS->REGLCTL == 0UL);
        
        // Switch SRAM0 to normal power mode
        if (PMC->SYSRB0PC != 0)
        {
            PMC->SYSRB0PC = 0;
            while (PMC->SYSRB0PC & PMC_SYSRB0PC_PCBUSY_Msk)
                ;
        }

        // Switch SRAM1 to normal power mode
        if (PMC->SYSRB1PC != 0)
        {
            PMC->SYSRB1PC = 0;
            while (PMC->SYSRB1PC & PMC_SYSRB1PC_PCBUSY_Msk)
                ;
        }

        // Enable SRAM0 and SRAM1 clock
        CLK->SRAMCTL |= (CLK_SRAMCTL_SRAM0CKEN_Msk | CLK_SRAMCTL_SRAM1CKEN_Msk);
    }
    
    __set_PSP((uint32_t)(&__INITIAL_SP));

    __set_MSPLIM((uint32_t)(&__STACK_LIMIT));
    __set_PSPLIM((uint32_t)(&__STACK_LIMIT));
    
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
    __TZ_set_STACKSEAL_S((uint32_t *)(&__STACK_SEAL));
#endif

    __PROGRAM_START();                        /* Enter PreMain (C library entry point) */
}


#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
    #pragma clang diagnostic ignored "-Wmissing-noreturn"
#endif

/*----------------------------------------------------------------------------
  Hard Fault Handler
 *----------------------------------------------------------------------------*/
extern void ProcessHardFault(uint32_t *excContext);

struct ExcContext
{
    uint32_t r0;
    uint32_t r1;
    uint32_t r2;
    uint32_t r3;
    uint32_t r12;
    uint32_t lr;
    uint32_t pc;
    uint32_t xPsr;
};

void HardFault_Handler(void)
{
    int irq;
    struct ExcContext *e;
    uint32_t sp;

    __asm volatile("mrs %0, ipsr            \n" // Read IPSR (Exceptio number)
                   "sub %0, #16             \n" // Get it into IRQn_Type range
                   "tst lr, #4              \n" // Select the stack which was in use
                   "ite eq                  \n"
                   "mrseq %1, msp           \n"
                   "mrsne %1, psp           \n"
                   "add %1, #16             \n"
                   "mov %2, sp              \n"
                   : "=r"(irq), "=r"(e), "=r"(sp));

    printf("Hard fault. irq=%d, pc=0x%08" PRIx32 ", lr=0x%08" PRIx32 ", xpsr=0x%08" PRIx32 ", sp=0x%08" PRIx32 "\n",
           irq, e->pc, e->lr, e->xPsr, sp);
    printf("%11s cfsr=0x%08" PRIx32 " bfar=0x%08" PRIx32 " mmfar=0x%08" PRIx32 "\n", "", SCB->CFSR, SCB->BFAR, SCB->MMFAR);

    /* Get the instruction caused the hardfault */
    ProcessHardFault((uint32_t *)e);
}

/*----------------------------------------------------------------------------
  Default Handler for Exceptions / Interrupts
 *----------------------------------------------------------------------------*/
void Default_Handler(void)
{
    while (1);
}

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
#endif
